Revit 2027 API
ApplicationEntryPoint.CreateRibbonPanel(String) Method
Namespace: Autodesk.Revit.UI.Macros
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override RibbonPanel CreateRibbonPanel(
	string panelName
)
Public Overrides Function CreateRibbonPanel (
	panelName As String
) As RibbonPanel
public:
virtual RibbonPanel^ CreateRibbonPanel(
	String^ panelName
) override
abstract CreateRibbonPanel :
        panelName : string -> RibbonPanel
override CreateRibbonPanel :
        panelName : string -> RibbonPanel
Parameters
panelName String
Return Value
RibbonPanel
See Also
Reference
ApplicationEntryPoint Class
CreateRibbonPanel Overload
Autodesk.Revit.UI.Macros Namespace